In [1]:
from scipy.stats import chi2
import pandas as pd
import numpy as np

In [2]:
Obs = pd.DataFrame(data=np.array([[209, 198, 177, 101], [104, 171, 158, 33], [135, 115, 39, 16]]), 
                    columns=['Agriculture', 'ArtsSciences', 'Engineering', 'ILR'], 
                    index=['Employed', 'GradSchool', 'Other'])

In [3]:
Obs

            Agriculture  ArtsSciences  Engineering  ILR
Employed            209           198          177  101
GradSchool          104           171          158   33
Other               135           115           39   16

In [4]:
Obs.sum()

Agriculture     448
ArtsSciences    484
Engineering     374
ILR             150
dtype: int64

In [27]:
total=Obs.sum().sum()
total

1456

In [6]:
Exp = pd.DataFrame()

In [8]:
total_dist = Obs.sum(axis=1)/total
total_dist

Employed      0.470467
GradSchool    0.320055
Other         0.209478
dtype: float64

In [11]:
Exp['Agriculture'] = total_dist * Obs.Agriculture.sum()
Exp['ArtsSciences'] = total_dist * Obs.ArtsSciences.sum()
Exp['Engineering'] = total_dist * Obs.Engineering.sum()
Exp['ILR'] = total_dist * Obs.ILR.sum()

In [12]:
Exp

            Agriculture  ArtsSciences  Engineering        ILR
Employed     210.769231    227.706044   175.954670  70.570055
GradSchool   143.384615    154.906593   119.700549  48.008242
Other         93.846154    101.387363    78.344780  31.421703

In [17]:
chi_square = (( Obs - Exp ) ** 2 / Exp).sum().sum()
chi_square

93.65667028628437

In [18]:
df = 2 * 3

In [23]:
pval = 1 - chi2.cdf(chi_square, df)
print(f"{pval:.2e}")

0.00e+00

In [ ]:
# reject the null, regardless of chosen alpha level

In [25]:
( Obs - Exp ) / np.sqrt( Exp )

            Agriculture  ArtsSciences  Engineering       ILR
Employed      -0.121866     -1.968600     0.078805  3.622354
GradSchool    -3.289087      1.293043     3.500616 -2.166067
Other          4.248173      1.351918    -4.445106 -2.751170

In [26]:
( Obs - Exp ) ** 2 / Exp

            Agriculture  ArtsSciences  Engineering        ILR
Employed       0.014851      3.875387     0.006210  13.121452
GradSchool    10.818092      1.671961    12.254312   4.691847
Other         18.046974      1.827682    19.758964   7.568938